Tekla.Structures.ModelInternal.ITeklaStructuresApplication
Represents TS functionality which is mostly implemented in .NET code and plugins, but needs to be implemented in the running application.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.SharedModelStateChanged
Implements Tekla.Structures.Model.ISharingEvents.SharedModelStateChanged.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginGetSharingLocalChanges(Tekla.Structures.Internal.IAsyncCallCompletion{System.Collections.Generic.Dictionary{System.String,System.Collections.Generic.List{Tekla.Structures.ModelInternal.HistoryItem}}})


Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginGetTCProjectsWithPointClouds(Tekla.Structures.Internal.IAsyncCallCompletion{System.Collections.Generic.IEnumerable{Tekla.Structures.Model.PointCloudDataServices.TCProject}})


Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginGetTCPointCloudUrl(System.String,System.String,System.String,Tekla.Structures.Internal.IAsyncCallCompletion{System.String})


Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginTestSharingOperationAsync(System.Boolean,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
Implements Tekla.Structures.ModelInternal.Operation.TestSharingOperationAsync(System.Boolean).
showProgressDialog: If true, TS would show modal progress dialog, blocking UI interaction.
endCallback: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginInviteSharingUserAsync(System.String,Tekla.Structures.Model.SharingRole,System.Boolean,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
Implements Tekla.Structures.Model.ModelSharingHandler.InviteUserAsync(System.String,Tekla.Structures.Model.SharingRole,System.Boolean,System.String,System.Nullable{System.Guid}).
userEmail: The user email.
role: The user role.
sendEmail: If set, send an invitation email to the new user.
customEmailMessage: If non-empty, add the message to the invitation email.
modelId: If nonempty, the model id to invite user to. If empty, user is added to the currently opened model.
endCallback: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginGetSharedModelsAsync(Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Collections.Generic.IEnumerable{Tekla.Structures.ModelInternal.SharedModel}}})
Implements Tekla.Structures.Model.ModelSharingHandler.GetModelsAsync.
endCallback: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginStartSharingAsync(System.String,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Guid}})
Implements Tekla.Structures.Model.ModelSharingHandler.StartSharingAsync(System.String,System.String,System.Nullable{System.Guid}).
code: The sharing code for the model.
description: A description for the shared model.
location: The location of the shared model. If empty, the default location is used.
endHandler: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginGetLocationsAsync(Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{Tekla.Structures.ModelInternal.SharingLocationsInformation}})
Implements Tekla.Structures.Model.ModelSharingHandler.GetLocationsAsync.
endHandler: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginRemoveModelAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
Implements Tekla.Structures.Model.ModelSharingHandler.RemoveModelAsync(System.Guid).
modelId: The identifier of the model to be removed.
endHandler: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginGetSharingUpdatesAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult{System.Collections.Generic.List{Tekla.Structures.ModelInternal.SharingUpdate}}})
Implements Tekla.Structures.Model.ModelSharingHandler.GetUpdatesAsync(System.Nullable{System.Guid}).
modelId: The identifier of the shared model to get updates for.
endHandler: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginJoinSharedModelAsync(System.Guid,System.String,System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
Implements Tekla.Structures.Model.ModelSharingHandler.JoinAsync(System.Guid,System.String,System.Nullable{System.Guid}).
modelId: The model identifier.
joinFolder: The folder to join to.
targetUpdateId: The update to join to. If empty, join to the latest update.
endHandler: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginReadInAsync(System.Guid,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
Implements Tekla.Structures.Model.ModelSharingHandler.ReadInAsync(System.Nullable{System.Guid}).
targetUpdate: The update to read in. If empty, reads in to the latest update.
endHandler: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginWriteOutAsync(System.String,System.String,System.Boolean,System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
Implements Tekla.Structures.Model.ModelSharingHandler.WriteOutAsync(System.String,System.String,System.String) and Tekla.Structures.Model.ModelSharingHandler.CreateBaselineAsync(System.String,System.String,System.String).
Automatically release the next write-out reservation if there is one.
code: The code for the write-out operation.
comment: A comment describing the write-out.
fullPacket: If true, writes out a full packet. If false, writes out an incremental packet.
releaseNextWriteOutComment: A comment for releasing the next write-out reservation. Should not be empty when it's provided..
endHandler: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginReserveNextWriteOutAsync(System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
Implements Tekla.Structures.Model.ModelSharingHandler.ReserveNextWriteOutAsync(System.String).
comment: A comment describing the reservation.
endHandler: The end callback.

Tekla.Structures.ModelInternal.ITeklaStructuresApplication.BeginReleaseNextWriteOutAsync(System.String,Tekla.Structures.Internal.IAsyncCallCompletion{Tekla.Structures.ModelInternal.SharingResult})
Implements Tekla.Structures.Model.ModelSharingHandler.ReleaseNextWriteOutAsync(System.String).
comment: A comment describing the release.
endHandler: The end callback.